/* 1. Дано число обозначающее день недели. Выяснить является номер дня недели выходным
   2. По двум заданным числам проверять является ли одно квадратом другого
   3. Задать номер четверти, показать диапазоны для возможных координат
   4. Найти расстояние между точками в пространстве 2D/3D*/
/*

double GetDistanceBetweenTwoPoints1(int x1, int x2, int y1, int y2)
{
return Math.Round(Math.Sqrt(Math.Pow(x1 - x2, 2) + Math.Pow(y1 - y2, 2)), 2);
}





// Найти расстояние между точками в пространстве 3D

double GetDistanceBetweenTwoPoints2(double x1, double x2, double y1, double y2, double z1, double z2)
{                           
    return Math.Round(Math.Sqrt(Math.Pow(x2 - x1, 2) + Math.Pow(y2 - y1, 2) + Math.Pow(z2 - z1, 2)), 2);
}
double result = GetDistanceBetweenTwoPoints2(x1, x2, y1, y2, z1, z2);
Console.WriteLine(result);
*/