""" Задача 32: Определить индексы элементов массива (списка), 
значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума и не больше заданного максимума)
       [ 0, 1, 2, 3,  4,  5, 6, 7,  8, 9, 10, 11,12,13, 14, 15,16, 17, 18,19]

Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
5
15
Вывод: [1, 9, 13, 14, 19] """



import random


n = int(input("Введите размер массива: "))


lis1 = [random.randint(-50, 50) for i in range(0,n)]
print(f"Массив: {lis1}")

min1 = int(input("Введите минимальное значение: "))
max1 = int(input("Введите максимальное значение: "))

print(lis1[min1:max1])