"""Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) 


n = int(input("Введите натуральное число: "))

a = n // 100
b = n % 100 // 10
c = n % 10

print(a + b + c)


"""


n = int(input("Введите натуральное число: "))
result = 0
while n > 0:
    c = n % 10
    result = result + c
    n = n // 10
print (result)